function Cube(origin,side,rotation){
    //rotation é um quat
    this.model = this.translation*this.rotation;
     //Definir vértices e índices
    this.vertices = [
    -1.0, -1.0, +1.0,
    +1.0, -1.0, +1.0,
    -1.0, +1.0, +1.0,
    +1.0, +1.0, +1.0,
    -1.0, +1.0, -1.0,
    +1.0, +1.0, -1.0,
    -1.0, -1.0, -1.0,
    +1.0, -1.0, -1.0
    ];

    this.indices = [
    0, 1, 2,
    2, 1, 3,
    2, 3, 4,
    4, 3, 5,
    4, 5, 6,
    6, 5, 7,
    6, 7, 0,
    0, 7, 1,
    1, 7, 3,
    3, 7, 5,
    6, 0, 4,
    4, 0, 2
    ];
    this.color = [
    1.0, 1.0, 1.0,
    1.0, 1.0, 1.0,
    1.0, 1.0, 1.0,
    1.0, 1.0, 1.0,
    1.0, 0.0, 0.0,
    1.0, 0.0, 0.0,
    1.0, 0.0, 0.0,
    1.0, 0.0, 0.0
    ];
}